// src/gui/UpdateModal/UpdateModal.ts
import { Modal, App } from 'obsidian';

export default class UpdateModal extends Modal {
    constructor(app: App ) {
        super(app);
    }

    onOpen() {
        const { contentEl } = this;
        contentEl.setAttribute('dir', 'rtl');
        contentEl.createEl('h3', { text: 'جدیدترین قابلیت‌های افزونه تقویم فارسی' });
        contentEl.createEl('p', { text: '- امکان تعیین نام‌گذاری روزنوشت‌ها بر اساس تاریخ میلادی: اکنون می‌توانید از تنظیمات، نام‌گذاری روزنوشت‌ها را بر اساس تاریخ میلادی تعریف کنید و با افزونه‌هایی مانند تقویم گوگل هماهنگ سازی نمایید.' });
        contentEl.createEl('p', { text: '- ارجاع به یادداشت‌ها با استفاده از علامت "@": با تایپ "@" می‌توانید به سادگی به یادداشت‌های مرتبط ارجاع دهید، مثلاً با نوشتن «امروز» به یادداشت امروز ارجاع دهید.' });
        contentEl.createEl('p', { text: '- دستور جدید برای ارتباط مستقیم با یادداشت‌های معنادار: با انتخاب کلمات کلیدی مثل «امروز» و استفاده از دستور «ارجاع متن به یادداشت دوره‌ای»، به طور مستقیم به یادداشت مرتبط وصل شوید.' });
        contentEl.createEl('p', { text: '- قرار دادن تاریخ معنادار در نوشته‌ها: با قرار دادن عبارت {{امروز}} در قالب‌ها، تاریخ روز جاری به طور خودکار در نوشته‌های جدید شما ظاهر می‌شود.' });
        contentEl.createEl('p', { text: '- تبدیل فرمت تاریخ بین شمسی و میلادی: با انتخاب تاریخ مورد نظر و اجرای دستور مرتبط، تبدیل بین تاریخ‌های شمسی و میلادی را به سادگی انجام دهید.' });
        contentEl.createEl('p', { text: '- حذف فوری نقاط در یادداشت: اگر نقطه‌ای را حذف کنید، بلافاصله از تقویم محو می‌شود.' });
        contentEl.createEl('p', { text: '- مطالعه راهنمای افزونه توصیه می‌شود: برای استفاده بهینه از افزونه، مطالعه راهنما در گیت‌هاب را فراموش نکنید.' });        
        contentEl.createEl('br'),
        contentEl.createEl('a', { text: 'کانال تلگرام کارفکر را برای اطلاعات بیشتر دنبال کنید.', href: 'https://t.me/karafkar' }),
        contentEl.createEl('br');
        
    }

    

    onClose() {
        this.contentEl.empty();
        this.close();
    }
}
